# 판다스(Pandas)

##### 데이터의 이해 
##### (CSV = ,로 구분되어있는 데이터)
##### (DataFrame = index는 range index가 자동으로 붙는다)

In [2]:
# 학습 전 반드시 실행: csv파일 (data.csv) 생성
import pandas as pd
data = {
    "메뉴":['아메리카노','카페라떼','카페모카', '바닐라라떼', '녹차', '초코라떼', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100, 4100, 5000, 5100],
    "할인율":[0.5, 0.1, 0.2, 0.3, 0, 0, 0],
    "칼로리":[10, 180, 420, 320, 20, 500, 400],
}
data = pd.DataFrame(data)
data.to_csv('data.csv', index=False)

# 라이브러리 불러오기

In [3]:
import pandas as pd

In [5]:
# 데이터 불러오기
pd.read_csv('data.csv')

        메뉴    가격  할인율  칼로리
0    아메리카노  4100  0.5   10
1     카페라떼  4600  0.1  180
2     카페모카  4600  0.2  420
3    바닐라라떼  5100  0.3  320
4       녹차  4100  0.0   20
5     초코라떼  5000  0.0  500
6  바닐라콜드브루  5100  0.0  400

In [6]:
# 데이터 불러와서 변수에 담기
df = pd.read_csv('data.csv')

In [7]:
# 데이터 샘플 확인 : 뒤에서 부터 n개 (기본 5개)
df.tail(3)

        메뉴    가격  할인율  칼로리
4       녹차  4100  0.0   20
5     초코라떼  5000  0.0  500
6  바닐라콜드브루  5100  0.0  400

# 데이터 프레임과 시리즈

In [9]:
# 시리즈 만들기 (문자열)

menu = pd.Series(['아아','아라','바콜'])
menu

0    아아
1    아라
2    바콜
dtype: object

In [10]:
# 시리즈 만들기 (정수형)
price = pd.Series([2000, 3000, 4000])
price

0    2000
1    3000
2    4000
dtype: int64

In [11]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
pd.DataFrame({
    "menu" : menu,
    "price" : price
})

  menu  price
0   아아   2000
1   아라   3000
2   바콜   4000

In [12]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
data = {
    "메뉴":['아메리카노','카페라떼','카페모카'],
    "가격":[4100,4600,4600],
    "할인율":[0.5, 0.1, 0.2],
    "칼로리":[10, 180, 420],
}
cafe = pd.DataFrame(data)
cafe

      메뉴    가격  할인율  칼로리
0  아메리카노  4100  0.5   10
1   카페라떼  4600  0.1  180
2   카페모카  4600  0.2  420

In [13]:
# 시리즈 선택 (가격)
df['메뉴']

0      아메리카노
1       카페라떼
2       카페모카
3      바닐라라떼
4         녹차
5       초코라떼
6    바닐라콜드브루
Name: 메뉴, dtype: object

In [18]:
# 데이터 프레임 선택 (가격)
df[['가격','할인율']]

     가격  할인율
0  4100  0.5
1  4600  0.1
2  4600  0.2
3  5100  0.3
4  4100  0.0
5  5000  0.0
6  5100  0.0

In [19]:
# 데이터 프레임 type 확인
type(df)

pandas.core.frame.DataFrame

In [20]:
# 시리즈 type 확인
type(df['가격'])

pandas.core.series.Series

# EDA(탐색적 데이터 분석)

In [21]:
# 데이터 불러오기 (에러가 뜬다면 가장 첫번쨰 셀, csv 파일을 생성하는 코드 실행)
df = pd.read_csv('data.csv')

In [22]:
# 데이터 프레임 크기 (행, 컬럼)
df.shape

(7, 4)

In [23]:
# 컬럼 형태(type)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   할인율     7 non-null      float64
 3   칼로리     7 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 352.0+ bytes

In [24]:
# 기초 통계
df.describe()

                가격       할인율         칼로리
count     7.000000  7.000000    7.000000
mean   4657.142857  0.157143  264.285714
std     435.343324  0.190238  196.965068
min    4100.000000  0.000000   10.000000
25%    4350.000000  0.000000  100.000000
50%    4600.000000  0.100000  320.000000
75%    5050.000000  0.250000  410.000000
max    5100.000000  0.500000  500.000000

In [26]:
# 기초 통계 (object)
df.describe(include = 'O')

           메뉴
count       7
unique      7
top     아메리카노
freq        1

In [27]:
# 상관관계
df.corr()

           가격       할인율       칼로리
가격   1.000000 -0.327738  0.853837
할인율 -0.327738  1.000000 -0.390151
칼로리  0.853837 -0.390151  1.000000

In [28]:
# 중복 값이 있는 데이터 생성
car = {
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
}
car = pd.DataFrame(car)
car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [29]:
# 항목 종류 수
car.nunique()

car     2
size    3
dtype: int64

In [31]:
# 항목 종류
car['car'].unique()

array(['Sedan', 'SUV'], dtype=object)

In [32]:
car['size'].unique()

array(['S', 'M', 'L'], dtype=object)

In [33]:
# 항목별 개수 (car)
car['car'].value_counts()

Sedan    7
SUV      4
Name: car, dtype: int64

In [34]:
# 항목별 개수 (size)
car['size'].value_counts()

S    6
M    4
L    1
Name: size, dtype: int64

# 자료형 변환

In [35]:
# 데이터 프레임 만들기 (할인율과 칼로리 -> 문자열)
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100],
    "할인율":['0.5', '0.1', '0.2', '0.3'],
    "칼로리":[10,180,420,320],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      object
 3   칼로리     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [39]:
# 자료형 변환 / astype / object -> float
df['할인율'] = df['할인율'].astype('float')

In [40]:
# 자료형 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      float64
 3   칼로리     4 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 256.0+ bytes

In [41]:
df

        메뉴    가격  할인율  칼로리
0    아메리카노  4100  0.5   10
1     카페라떼  4600  0.1  180
2     카페모카  4600  0.2  420
3  바닐라콜드브루  5100  0.3  320

In [43]:
# 새로운 컬럼 추가 (값은 0)
df['new'] = 0
df

        메뉴    가격  할인율  칼로리  new
0    아메리카노  4100  0.5   10    0
1     카페라떼  4600  0.1  180    0
2     카페모카  4600  0.2  420    0
3  바닐라콜드브루  5100  0.3  320    0

In [45]:
# 할인가 컬럼 추가 
df['할인가'] = df['가격'] * (1-df['할인율'])
df

        메뉴    가격  할인율  칼로리  new     할인가
0    아메리카노  4100  0.5   10    0  2050.0
1     카페라떼  4600  0.1  180    0  4140.0
2     카페모카  4600  0.2  420    0  3680.0
3  바닐라콜드브루  5100  0.3  320    0  3570.0

In [47]:
# 결측값으로 추가, 원두 컬럼을 만들고 결측값(NaN)으로 대입
import numpy as np
df['원두'] = np.nan
df

        메뉴    가격  할인율  칼로리  new     할인가  원두
0    아메리카노  4100  0.5   10    0  2050.0 NaN
1     카페라떼  4600  0.1  180    0  4140.0 NaN
2     카페모카  4600  0.2  420    0  3680.0 NaN
3  바닐라콜드브루  5100  0.3  320    0  3570.0 NaN

# 데이터 삭제

In [50]:
# 데이터 삭제
# axis = 1 : 열방향(컬럼) / axis = 0 : 행방향
df = df.drop('new',axis = 1)

In [51]:
# 데이터 확인
df.head(2)

      메뉴    가격  할인율  칼로리     할인가  원두
0  아메리카노  4100  0.5   10  2050.0 NaN
1   카페라떼  4600  0.1  180  4140.0 NaN

In [52]:
# 행 삭제
df = df.drop(1,axis = 0)

In [53]:
# 데이터 확인
df

        메뉴    가격  할인율  칼로리     할인가  원두
0    아메리카노  4100  0.5   10  2050.0 NaN
2     카페모카  4600  0.2  420  3680.0 NaN
3  바닐라콜드브루  5100  0.3  320  3570.0 NaN

# CSV 저장하기

In [57]:
# csv로 저장하기
df.to_csv('data2.csv', index = False)
df.to_csv('data3.csv')

In [56]:
# csv 불러오기
new_df = pd.read_csv('data2.csv')
new_df.head()

        메뉴    가격  할인율  칼로리     할인가  원두
0    아메리카노  4100  0.5   10  2050.0 NaN
1     카페모카  4600  0.2  420  3680.0 NaN
2  바닐라콜드브루  5100  0.3  320  3570.0 NaN

In [58]:
new_df2 = pd.read_csv('data3.csv')
new_df2.head()

   Unnamed: 0       메뉴    가격  할인율  칼로리     할인가  원두
0           0    아메리카노  4100  0.5   10  2050.0 NaN
1           2     카페모카  4600  0.2  420  3680.0 NaN
2           3  바닐라콜드브루  5100  0.3  320  3570.0 NaN

In [59]:
# 1. 이벤트가 컬럼 만들기
# - 원 가격의 50% 할인을 적용한 이벤트 가격
df['이벤트가격'] = df['가격'] * 0.5

In [60]:
df

        메뉴    가격  할인율  칼로리     할인가  원두   이벤트가격
0    아메리카노  4100  0.5   10  2050.0 NaN  2050.0
2     카페모카  4600  0.2  420  3680.0 NaN  2300.0
3  바닐라콜드브루  5100  0.3  320  3570.0 NaN  2550.0

In [61]:
# 2. 할인가 컬럼 만들기
# - 할인을 적용한 할인가격
df['할인가'] = df['가격'] * (1-df['할인율'].astype('float'))
df

        메뉴    가격  할인율  칼로리     할인가  원두   이벤트가격
0    아메리카노  4100  0.5   10  2050.0 NaN  2050.0
2     카페모카  4600  0.2  420  3680.0 NaN  2300.0
3  바닐라콜드브루  5100  0.3  320  3570.0 NaN  2550.0

In [64]:
# 3. 컬럼 삭제
# - 칼로리 컬럼 삭제
df = df.drop('칼로리',axis = 1)

In [66]:
df

        메뉴    가격  할인율     할인가  원두   이벤트가격
0    아메리카노  4100  0.5  2050.0 NaN  2050.0
2     카페모카  4600  0.2  3680.0 NaN  2300.0
3  바닐라콜드브루  5100  0.3  3570.0 NaN  2550.0